# Brew itself - do these first.
tap "homebrew/bundle"
brew "mas"

#
# Homebrew
#

# Modern shell world
brew "fish"
brew "bat"
brew "btop"
brew "dust"
brew "fd"
brew "jq"
brew "ripgrep"
brew "pwgen"
brew "figlet"


# MacOS Compatibility
brew "base64"

brew "grep"
brew "joe"
brew "make"
brew "pinentry-mac"
brew "gnu-sed"
brew "zlib"

# Enhance MacOS
brew "switchaudio-osx"

# General Development
brew "direnv"
brew "gh"
brew "git"
brew "git-who"
brew "minisign"
brew "signify-osx"
brew "yamllint"


# Diffing hell
brew "tkdiff"
brew "diffoscope"


# Go Development
brew "go"


# Python Development
brew "black"
brew "docutils"
brew "isort"
brew "pipx"
brew "pygments"
brew "python@3.11"
brew "virtualenv"


#
# Cask: MacOS GUI Apps
#
cask "appcleaner"


#
# VSCode Stuff
#

# General
vscode "editorconfig.editorconfig"
vscode "chrislajoie.vscode-modelines"
vscode "aaron-bond.better-comments"
vscode "gruntfuggly.todo-tree"
vscode "npxms.hide-gitignored"
vscode "pdconsec.vscode-print"
vscode "rslfrkndmrky.rsl-vsc-focused-folder"
vscode "stkb.rewrap"
#vscode "wdawson.better-kill-ring"
vscode "streetsidesoftware.code-spell-checker"

# Markdown
vscode "bierner.markdown-preview-github-styles"
vscode "davidanson.vscode-markdownlint"

vscode "emmanuelbeziat.vscode-great-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "pkief.material-icon-theme"
vscode "vscode-icons-team.vscode-icons"

# Go
vscode "golang.go"

# Fish
vscode "bmalehorn.vscode-fish"
vscode "ndonfris.fish-lsp"

# Python
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"

# YAML
vscode "redhat.vscode-yaml"


#
# MAS: Mac App Store Apps
#

# Basic MacOS Apps
mas "Things", id: 904280696
mas "DaisyDisk", id: 411643860
mas "Password Factory", id: 888806818

# Time Management
mas "Timeless", id: 1017047129
mas "AS TimerPRO", id: 1486015273

# Development
mas "MarkEdit", id: 1669953820
mas "CompareMerge2", id: 1459748650
mas "Get Plain Text", id: 508368068
mas "Compare Folders", id: 816042486
mas "CotEditor", id: 1024640650

# Apple Productivity
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
